'''
#10 საცავი - ჯუნიორ ჰაკერი :)
თამაში არის შემდეგი - გვაქვს სეიფი რომელსაც აქვს ციფრები 1-6 მდე პაროლი არ ვიცით,
ყოველ დღე კომპიუტერი აგენერირებს ახალ პაროლს (შემთხვევითობის პრინციპით) პაროლი არის 4 ციფრიანი.
ჩვენი მიზანია დავწეროთ ისეთი კოდი რომელიც შეამოწმებს ვარიანტებს და როცა მოხდება კომპიუტერის მიერ
დაგენერირებული პაროლის დამთხვევა უნდა გამოვიტანოთ შეტყობინება "პაროლი სწორია, საცავი გახსნილია",
აუცილებელი პირობაა გამოვიტანოთ ყველა ჩვენს მიერ ნაცადი პაროლი სანამ მივალთ სწორ ვარიანტამდე.
'''

import random
from itertools import product

# პაროლის გენერაცია
password = [random.randint(1, 6) for _ in range(4)]
print("კომპიუტერმა შექმნა პაროლი.")

mcdelobebi = []  # აქ შევინახავთ ყველა მცდელობას

# ყველა შესაძლო კომბინაციის გამოცდა
for mcdeloba in product(range(1, 7), repeat=4):
    mcdeloba_str = "".join(str(x) for x in mcdeloba)
    mcdelobebi.append(mcdeloba_str)

    if list(mcdeloba) == password:
        print( mcdeloba_str,"- პაროლი სწორია, საცავი გახსნილია")
        break

# მცდელობების დაბეჭდვა
print("\nნაცადი პაროლები:")
for i in range(0, len(mcdelobebi), 6):
    print("  ".join(mcdelobebi[i:i + 6]))
